In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
import datetime

In [3]:
datetime.date.today()

datetime.date(2022, 9, 18)

In [5]:
today = datetime.date(2022, 8, 19)
today.year, today.month, today.day

(2022, 8, 19)

In [6]:
delta = datetime.datetime(2022, 8, 19) - datetime.datetime(2011,3, 20, 7, 12)

In [7]:
print(delta)
print(delta.days)
print(delta.seconds)

4169 days, 16:48:00
4169
60480

In [4]:
dates = [pd.Timestamp("2021-12-01"),
         pd.Timestamp("2021-12-02"),
         pd.Timestamp("2021-12-03")]

ts = pd.Series(np.random.randn(3), dates)

In [5]:
ts.index

DatetimeIndex(['2021-12-01', '2021-12-02', '2021-12-03'], dtype='datetime64[ns]', freq=None)

In [6]:
ts

2021-12-01   -0.305565
2021-12-02    0.548434
2021-12-03   -0.800754
dtype: float64

In [8]:
periods = [pd.Period("2021-12"), pd.Period("2021-01"), pd.Period("2022-02")]
ts = pd.Series(np.random.randn(3), periods)

In [9]:
ts.index

PeriodIndex(['2021-12', '2021-01', '2022-02'], dtype='period[M]')

In [5]:
ts

2021-12    1.199820
2021-01   -1.897174
2022-02   -0.355545
Freq: M, dtype: float64

In [14]:
pd.Series(['May 20, 2021', '2022-03-10', '2022.06.01', '08/12/2022', None])

0    May 20, 2021
1      2022-03-10
2      2022.06.01
3      08/12/2022
4            None
dtype: object

In [16]:
pd.to_datetime(pd.Series(['May 20, 2021', '2022-03-10', '2022.06.01', '08/12/2022', None]))

0   2021-05-20
1   2022-03-10
2   2022-06-01
3   2022-08-12
4          NaT
dtype: datetime64[ns]

In [25]:
pd.to_datetime(['06-08-2022 12:00'], dayfirst=True)

DatetimeIndex(['2022-08-06 12:00:00'], dtype='datetime64[ns]', freq=None)

In [27]:
pd.to_datetime(['12:00 06-08-2022'], dayfirst=True)

DatetimeIndex(['2022-08-06 12:00:00'], dtype='datetime64[ns]', freq=None)

In [38]:
pd.to_datetime('2022/03/12', format='%Y/%m/%d')

Timestamp('2022-03-12 00:00:00')

In [49]:
pd.to_datetime('25-Dec-2022 00:00', format=''%d-%b-%Y %H:%M')

Timestamp('2022-12-25 00:00:00')

In [64]:
date = pd.DataFrame(
    {'year': [2020, 2021, 2022, 2023, 2025], 'month': [2, 3, 9 , 10, 11], 
     'day': [3, 8, 12, 20, 28], 'hour': [5, 3, 4, 3, 1]})
date

   year  month  day  hour
0  2020      2    3     5
1  2021      3    8     3
2  2022      9   12     4
3  2023     10   20     3
4  2025     11   28     1

In [65]:
date['All'] = pd.to_datetime(df[['year', 'month', 'day', 'hour']])
date

   year  month  day  hour                 All
0  2020      2    3     5 2020-02-03 05:00:00
1  2021      3    8     3 2021-03-08 03:00:00
2  2022      9   12     4 2022-09-12 04:00:00
3  2023     10   20     3 2023-10-20 03:00:00
4  2025     11   28     1 2025-11-28 01:00:00

In [69]:
pd.to_datetime(['2022/02/17', 'no time'], errors='coerce')

DatetimeIndex(['2022-02-17', 'NaT'], dtype='datetime64[ns]', freq=None)

In [5]:
dates = [datetime.datetime(2022, 7, 1),
         datetime.datetime(2022, 7, 2),
         datetime.datetime(2022, 7, 3)]

index = pd.DatetimeIndex(dates)

In [6]:
index

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03'], dtype='datetime64[ns]', freq=None)

In [5]:
start = datetime.datetime(2022, 1, 1)
end = datetime.datetime(2023, 1, 1)

index = pd.date_range(start, end)

In [8]:
index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10',
               ...
               '2022-12-23', '2022-12-24', '2022-12-25', '2022-12-26',
               '2022-12-27', '2022-12-28', '2022-12-29', '2022-12-30',
               '2022-12-31', '2023-01-01'],
              dtype='datetime64[ns]', length=366, freq='D')

In [9]:
index = pd.bdate_range(start, end)
index

DatetimeIndex(['2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06',
               '2022-01-07', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14',
               ...
               '2022-12-19', '2022-12-20', '2022-12-21', '2022-12-22',
               '2022-12-23', '2022-12-26', '2022-12-27', '2022-12-28',
               '2022-12-29', '2022-12-30'],
              dtype='datetime64[ns]', length=260, freq='B')

In [11]:
pd.date_range(start, periods=200, freq='M')

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30',
               '2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31',
               '2022-09-30', '2022-10-31',
               ...
               '2037-11-30', '2037-12-31', '2038-01-31', '2038-02-28',
               '2038-03-31', '2038-04-30', '2038-05-31', '2038-06-30',
               '2038-07-31', '2038-08-31'],
              dtype='datetime64[ns]', length=200, freq='M')

In [12]:
pd.bdate_range(start, periods=300, freq='BQS')

DatetimeIndex(['2022-01-03', '2022-04-01', '2022-07-01', '2022-10-03',
               '2023-01-02', '2023-04-03', '2023-07-03', '2023-10-02',
               '2024-01-01', '2024-04-01',
               ...
               '2094-07-01', '2094-10-01', '2095-01-03', '2095-04-01',
               '2095-07-01', '2095-10-03', '2096-01-02', '2096-04-02',
               '2096-07-02', '2096-10-01'],
              dtype='datetime64[ns]', length=300, freq='BQS-JAN')

In [13]:
pd.date_range(start, periods=10, freq='6H')

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-01 06:00:00',
               '2022-01-01 12:00:00', '2022-01-01 18:00:00',
               '2022-01-02 00:00:00', '2022-01-02 06:00:00',
               '2022-01-02 12:00:00', '2022-01-02 18:00:00',
               '2022-01-03 00:00:00', '2022-01-03 06:00:00'],
              dtype='datetime64[ns]', freq='6H')

In [6]:
date = pd.date_range(start, end, freq='BM')
time_series = pd.Series(np.random.randn(len(date)), index=date)

In [7]:
time_series.index

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-29',
               '2022-05-31', '2022-06-30', '2022-07-29', '2022-08-31',
               '2022-09-30', '2022-10-31', '2022-11-30', '2022-12-30'],
              dtype='datetime64[ns]', freq='BM')

In [8]:
time_series[:5].index

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-29',
               '2022-05-31'],
              dtype='datetime64[ns]', freq='BM')

In [9]:
time_series[::2].index

DatetimeIndex(['2022-01-31', '2022-03-31', '2022-05-31', '2022-07-29',
               '2022-09-30', '2022-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [3]:
start = datetime.datetime(2022, 1, 1)
end = datetime.datetime(2023, 1, 1)
date = pd.date_range(start, end, freq='T')
time_series = pd.Series(np.random.randn(len(date)), index=date)

In [4]:
time_series

2022-01-01 00:00:00   -0.656222
2022-01-01 00:01:00   -0.630382
2022-01-01 00:02:00   -0.136456
2022-01-01 00:03:00   -2.069073
2022-01-01 00:04:00   -0.521989
                         ...
2022-12-31 23:56:00   -0.183773
2022-12-31 23:57:00    0.173342
2022-12-31 23:58:00   -1.731085
2022-12-31 23:59:00    0.439377
2023-01-01 00:00:00   -0.048831
Freq: T, Length: 525601, dtype: float64

In [4]:
time_series['3/1/2022']

2022-03-01 00:00:00    0.542068
2022-03-01 00:01:00    0.592895
2022-03-01 00:02:00    0.194921
2022-03-01 00:03:00    1.031994
2022-03-01 00:04:00    1.903584
                         ...
2022-03-01 23:55:00    1.114991
2022-03-01 23:56:00   -0.105563
2022-03-01 23:57:00    0.757695
2022-03-01 23:58:00   -0.995502
2022-03-01 23:59:00   -1.812941
Freq: T, Length: 1440, dtype: float64

In [5]:
time_series['2022.03.01']

2022-03-01 00:00:00    0.542068
2022-03-01 00:01:00    0.592895
2022-03-01 00:02:00    0.194921
2022-03-01 00:03:00    1.031994
2022-03-01 00:04:00    1.903584
                         ...
2022-03-01 23:55:00    1.114991
2022-03-01 23:56:00   -0.105563
2022-03-01 23:57:00    0.757695
2022-03-01 23:58:00   -0.995502
2022-03-01 23:59:00   -1.812941
Freq: T, Length: 1440, dtype: float64

In [6]:
time_series.loc['2022.03.01']

2022-03-01 00:00:00    0.542068
2022-03-01 00:01:00    0.592895
2022-03-01 00:02:00    0.194921
2022-03-01 00:03:00    1.031994
2022-03-01 00:04:00    1.903584
                         ...
2022-03-01 23:55:00    1.114991
2022-03-01 23:56:00   -0.105563
2022-03-01 23:57:00    0.757695
2022-03-01 23:58:00   -0.995502
2022-03-01 23:59:00   -1.812941
Freq: T, Length: 1440, dtype: float64

In [13]:
time_series['5/10/2022':'5/15/2022']

2022-05-10 00:00:00   -0.464096
2022-05-10 00:01:00   -0.663551
2022-05-10 00:02:00   -0.780966
2022-05-10 00:03:00    1.389312
2022-05-10 00:04:00    0.853637
                         ...
2022-05-15 23:55:00    1.261957
2022-05-15 23:56:00    0.248920
2022-05-15 23:57:00   -1.305952
2022-05-15 23:58:00    0.369071
2022-05-15 23:59:00    1.356335
Freq: T, Length: 8640, dtype: float64

In [14]:
time_series['2022-10']

2022-10-01 00:00:00    1.340023
2022-10-01 00:01:00   -2.399847
2022-10-01 00:02:00   -0.065270
2022-10-01 00:03:00    0.259887
2022-10-01 00:04:00   -0.172444
                         ...
2022-10-31 23:55:00    0.121721
2022-10-31 23:56:00    0.144960
2022-10-31 23:57:00    1.365017
2022-10-31 23:58:00    1.682285
2022-10-31 23:59:00   -0.363602
Freq: T, Length: 44640, dtype: float64

In [48]:
time_series['10/2022'][::5]

2022-10-01 00:00:00    0.830858
2022-10-01 00:05:00   -0.835449
2022-10-01 00:10:00   -0.816051
2022-10-01 00:15:00   -0.429671
2022-10-01 00:20:00   -1.037069
                         ...
2022-10-31 23:35:00   -2.159410
2022-10-31 23:40:00   -0.235876
2022-10-31 23:45:00    0.398520
2022-10-31 23:50:00    0.133619
2022-10-31 23:55:00   -0.855305
Freq: 5T, Length: 8928, dtype: float64

In [15]:
time_series['2022-1':'2022-3']

2022-01-01 00:00:00    1.706773
2022-01-01 00:01:00    1.021036
2022-01-01 00:02:00    0.927140
2022-01-01 00:03:00    0.434494
2022-01-01 00:04:00    1.059813
                         ...
2022-03-31 23:55:00    1.425213
2022-03-31 23:56:00   -0.591575
2022-03-31 23:57:00    0.762000
2022-03-31 23:58:00    0.341552
2022-03-31 23:59:00    0.675635
Freq: T, Length: 129600, dtype: float64

In [10]:
time_series['2022-1-18 10:20:00']

-0.3944044797088744

In [11]:
time_series['2022-1-18 10:20:00':'2022-3-21 12:30:00']

2022-01-18 10:20:00   -0.394404
2022-01-18 10:21:00   -0.975685
2022-01-18 10:22:00    1.315656
2022-01-18 10:23:00    1.915662
2022-01-18 10:24:00    1.401609
                         ...
2022-03-21 12:26:00   -0.428319
2022-03-21 12:27:00   -1.549625
2022-03-21 12:28:00   -0.718706
2022-03-21 12:29:00    0.251120
2022-03-21 12:30:00    0.038957
Freq: T, Length: 89411, dtype: float64

In [18]:
time_series[datetime.datetime(2022, 1, 1) : datetime.datetime(2022, 2, 28)]

2022-01-01 00:00:00    1.706773
2022-01-01 00:01:00    1.021036
2022-01-01 00:02:00    0.927140
2022-01-01 00:03:00    0.434494
2022-01-01 00:04:00    1.059813
                         ...
2022-02-27 23:56:00    0.803520
2022-02-27 23:57:00   -1.404219
2022-02-27 23:58:00    0.159093
2022-02-27 23:59:00   -0.093704
2022-02-28 00:00:00   -0.756051
Freq: T, Length: 83521, dtype: float64

In [19]:
time_series[datetime.datetime(2022, 1, 1, 10, 12, 0) : datetime.datetime(2022, 2, 28, 10, 12, 0)]

2022-01-01 10:12:00   -0.973254
2022-01-01 10:13:00    0.511100
2022-01-01 10:14:00   -0.496870
2022-01-01 10:15:00   -0.742284
2022-01-01 10:16:00    0.273580
                         ...
2022-02-28 10:08:00   -0.259353
2022-02-28 10:09:00    0.680585
2022-02-28 10:10:00   -1.219548
2022-02-28 10:11:00   -0.974882
2022-02-28 10:12:00   -1.293792
Freq: T, Length: 83521, dtype: float64

In [3]:
date_range = pd.date_range('2022-01-01', '2023-01-01', freq='W')
time_series_2 = pd.Series(np.random.randn(len(date_range)), index=date_range)

In [4]:
time_series_2.truncate(before='2022-11')

2022-11-06   -1.190367
2022-11-13   -0.383181
2022-11-20   -1.980531
2022-11-27   -1.630708
2022-12-04   -0.026590
2022-12-11    0.169991
2022-12-18    0.789561
2022-12-25    1.975248
2023-01-01    0.388513
Freq: W-SUN, dtype: float64

In [21]:
time_series_2.truncate(before='2022-11', after='2022-12')

2022-11-06    0.722276
2022-11-13   -1.155483
2022-11-20    0.992023
2022-11-27    0.699238
Freq: W-SUN, dtype: float64

In [22]:
time_series_2['2022-11':'2022-12']

2022-11-06    0.722276
2022-11-13   -1.155483
2022-11-20    0.992023
2022-11-27    0.699238
2022-12-04    0.490644
2022-12-11    0.023820
2022-12-18    0.600032
2022-12-25    1.126088
Freq: W-SUN, dtype: float64

In [3]:
data_air = pd.read_excel('../datasets/AirQualityUCI.xlsx')

In [4]:
data_air.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,Unnamed: 15,Unnamed: 16
0,2004-03-10,18:00:00,2.6,1360.00,150,11.881723,1045.50,166.0,1056.25,113.0,1692.00,1267.50,13.60,48.875001,0.757754,NaN,NaN
1,2004-03-10,19:00:00,2.0,1292.25,112,9.397165,954.75,103.0,1173.75,92.0,1558.75,972.25,13.30,47.700000,0.725487,NaN,NaN
2,2004-03-10,20:00:00,2.2,1402.00,88,8.997817,939.25,131.0,1140.00,114.0,1554.50,1074.00,11.90,53.975000,0.750239,NaN,NaN
3,2004-03-10,21:00:00,2.2,1375.50,80,9.228796,948.25,172.0,1092.00,122.0,1583.75,1203.25,11.00,60.000000,0.786713,NaN,NaN
4,2004-03-10,22:00:00,1.6,1272.25,51,6.518224,835.50,131.0,1205.00,116.0,1490.00,1110.00,11.15,59.575001,0.788794,NaN,NaN

Attribute Information:

0 Date (DD/MM/YYYY) 1 Time (HH.MM.SS) 2 True hourly averaged concentration CO in mg/m^3 (reference analyzer) 3 PT08.S1 (tin oxide) hourly averaged sensor response (nominally CO targeted) 4 True hourly averaged overall Non Metanic HydroCarbons concentration in microg/m^3 (reference analyzer) 5 True hourly averaged Benzene concentration in microg/m^3 (reference analyzer) 6 PT08.S2 (titania) hourly averaged sensor response (nominally NMHC targeted) 7 True hourly averaged NOx concentration in ppb (reference analyzer) 8 PT08.S3 (tungsten oxide) hourly averaged sensor response (nominally NOx targeted) 9 True hourly averaged NO2 concentration in microg/m^3 (reference analyzer) 10 PT08.S4 (tungsten oxide) hourly averaged sensor response (nominally NO2 targeted) 11 PT08.S5 (indium oxide) hourly averaged sensor response (nominally O3 targeted) 12 Temperature in Â°C 13 Relative Humidity (%) 14 AH Absolute Humidity

In [5]:
data_air = data_air[['Date', 'Time', 'T', 'RH', 'AH']]

In [6]:
data_air.head()

        Date      Time      T         RH        AH
0 2004-03-10  18:00:00  13.60  48.875001  0.757754
1 2004-03-10  19:00:00  13.30  47.700000  0.725487
2 2004-03-10  20:00:00  11.90  53.975000  0.750239
3 2004-03-10  21:00:00  11.00  60.000000  0.786713
4 2004-03-10  22:00:00  11.15  59.575001  0.788794

In [7]:
data_air['Date'].dtype

dtype('<M8[ns]')

In [8]:
data_air['Date'].dt.year

0       2004
1       2004
2       2004
3       2004
4       2004
        ...
9352    2005
9353    2005
9354    2005
9355    2005
9356    2005
Name: Date, Length: 9357, dtype: int64

In [9]:
data_air['year'] = data_air['Date'].dt.year

In [10]:
data_air['year'].dtype

dtype('int64')

In [11]:
data_air['Date'].dt.month

0       3
1       3
2       3
3       3
4       3
       ..
9352    4
9353    4
9354    4
9355    4
9356    4
Name: Date, Length: 9357, dtype: int64

In [12]:
data_air['month'] = data_air['Date'].dt.month

In [13]:
data_air['Date'].dt.day

0       10
1       10
2       10
3       10
4       10
        ..
9352     4
9353     4
9354     4
9355     4
9356     4
Name: Date, Length: 9357, dtype: int64

In [14]:
data_air['day'] = data_air['Date'].dt.day

In [15]:
data_air.head()

        Date      Time      T         RH        AH  year  month  day
0 2004-03-10  18:00:00  13.60  48.875001  0.757754  2004      3   10
1 2004-03-10  19:00:00  13.30  47.700000  0.725487  2004      3   10
2 2004-03-10  20:00:00  11.90  53.975000  0.750239  2004      3   10
3 2004-03-10  21:00:00  11.00  60.000000  0.786713  2004      3   10
4 2004-03-10  22:00:00  11.15  59.575001  0.788794  2004      3   10

In [16]:
data_air.tail()

           Date      Time       T      RH        AH  year  month  day
9352 2005-04-04  10:00:00  21.850  29.250  0.756824  2005      4    4
9353 2005-04-04  11:00:00  24.325  23.725  0.711864  2005      4    4
9354 2005-04-04  12:00:00  26.900  18.350  0.640649  2005      4    4
9355 2005-04-04  13:00:00  28.325  13.550  0.513866  2005      4    4
9356 2005-04-04  14:00:00  28.500  13.125  0.502804  2005      4    4

In [21]:
data_air['Date'].dt.isocalendar()

      year  week  day
0     2004    11    3
1     2004    11    3
2     2004    11    3
3     2004    11    3
4     2004    11    3
...    ...   ...  ...
9352  2005    14    1
9353  2005    14    1
9354  2005    14    1
9355  2005    14    1
9356  2005    14    1

[9357 rows x 3 columns]

In [20]:
data_air['weekday'] = data_air['Date'].dt.weekday

In [22]:
data_air[['iso_year', 'iso_week', 'iso_day']] = data_air['Date'].dt.isocalendar()

In [23]:
data_air.head()

,Date,Time,T,RH,AH,year,month,day,weekday,iso_year,iso_week,iso_day
0,2004-03-10,18:00:00,13.60,48.875001,0.757754,2004,3,10,2,2004,11,3
1,2004-03-10,19:00:00,13.30,47.700000,0.725487,2004,3,10,2,2004,11,3
2,2004-03-10,20:00:00,11.90,53.975000,0.750239,2004,3,10,2,2004,11,3
3,2004-03-10,21:00:00,11.00,60.000000,0.786713,2004,3,10,2,2004,11,3
4,2004-03-10,22:00:00,11.15,59.575001,0.788794,2004,3,10,2,2004,11,3

In [25]:
data_air['iso_day'].value_counts()

4    1344
5    1344
6    1344
7    1344
1    1335
3    1326
2    1320
Name: iso_day, dtype: Int64

In [5]:
data_air = pd.read_csv('../datasets/AirQualityUCI.csv', sep = ';')
data_air = data_air[['Date', 'Time', 'T', 'RH', 'AH']]

In [8]:
data_air.head()

         Date      Time     T    RH      AH
0  10/03/2004  18.00.00  13,6  48,9  0,7578
1  10/03/2004  19.00.00  13,3  47,7  0,7255
2  10/03/2004  20.00.00  11,9  54,0  0,7502
3  10/03/2004  21.00.00  11,0  60,0  0,7867
4  10/03/2004  22.00.00  11,2  59,6  0,7888

In [9]:
data_air.dtypes

Date    object
Time    object
T       object
RH      object
AH      object
dtype: object

In [10]:
# 에러상황을 보여주기 위한 부분으로 삭제하지 마세요.
data_air[['T', 'RH', 'AH']].astype(float)

ValueError: could not convert string to float: '13,6'

In [11]:
data_air['T'] = data_air['T'].str.replace(',', '.').astype(float)
data_air['RH'] = data_air['RH'].str.replace(',', '.').astype(float)
data_air['AH'] = data_air['AH'].str.replace(',', '.').astype(float)

In [12]:
data_air.dtypes

Date     object
Time     object
T       float64
RH      float64
AH      float64
dtype: object

In [13]:
data_air['Date_Time'] = data_air['Date'] + ' ' + data_air['Time']

In [14]:
data_air.head()

         Date      Time     T    RH      AH            Date_Time
0  10/03/2004  18.00.00  13.6  48.9  0.7578  10/03/2004 18.00.00
1  10/03/2004  19.00.00  13.3  47.7  0.7255  10/03/2004 19.00.00
2  10/03/2004  20.00.00  11.9  54.0  0.7502  10/03/2004 20.00.00
3  10/03/2004  21.00.00  11.0  60.0  0.7867  10/03/2004 21.00.00
4  10/03/2004  22.00.00  11.2  59.6  0.7888  10/03/2004 22.00.00

In [15]:
data_air = data_air.dropna()

In [16]:
pd.to_datetime(data_air['Date_Time'], format='%d/%m/%Y %H.%M.%S')

0      2004-03-10 18:00:00
1      2004-03-10 19:00:00
2      2004-03-10 20:00:00
3      2004-03-10 21:00:00
4      2004-03-10 22:00:00
               ...
9352   2005-04-04 10:00:00
9353   2005-04-04 11:00:00
9354   2005-04-04 12:00:00
9355   2005-04-04 13:00:00
9356   2005-04-04 14:00:00
Name: Date_Time, Length: 9357, dtype: datetime64[ns]

In [17]:
data_air['Date_Time'] = pd.to_datetime(data_air['Date_Time'], format='%d/%m/%Y %H.%M.%S')

In [18]:
data_air.head()

         Date      Time     T    RH      AH           Date_Time
0  10/03/2004  18.00.00  13.6  48.9  0.7578 2004-03-10 18:00:00
1  10/03/2004  19.00.00  13.3  47.7  0.7255 2004-03-10 19:00:00
2  10/03/2004  20.00.00  11.9  54.0  0.7502 2004-03-10 20:00:00
3  10/03/2004  21.00.00  11.0  60.0  0.7867 2004-03-10 21:00:00
4  10/03/2004  22.00.00  11.2  59.6  0.7888 2004-03-10 22:00:00

In [19]:
data_air['Date_Time'].dt.hour

0       18
1       19
2       20
3       21
4       22
        ..
9352    10
9353    11
9354    12
9355    13
9356    14
Name: Date_Time, Length: 9357, dtype: int64

In [20]:
data_air['hour'] = data_air['Date_Time'].dt.hour

In [21]:
data_air.head()

         Date      Time     T    RH      AH           Date_Time  hour
0  10/03/2004  18.00.00  13.6  48.9  0.7578 2004-03-10 18:00:00    18
1  10/03/2004  19.00.00  13.3  47.7  0.7255 2004-03-10 19:00:00    19
2  10/03/2004  20.00.00  11.9  54.0  0.7502 2004-03-10 20:00:00    20
3  10/03/2004  21.00.00  11.0  60.0  0.7867 2004-03-10 21:00:00    21
4  10/03/2004  22.00.00  11.2  59.6  0.7888 2004-03-10 22:00:00    22

In [22]:
data_air['year'] = data_air['Date_Time'].dt.year
data_air['month'] = data_air['Date_Time'].dt.month
data_air['day'] = data_air['Date_Time'].dt.day
data_air['weekday'] = data_air['Date_Time'].dt.weekday

In [23]:
data_air.head()

,Date,Time,T,RH,AH,Date_Time,hour,year,month,day,weekday
0,10/03/2004,18.00.00,13.6,48.9,0.7578,2004-03-10 18:00:00,18,2004,3,10,2
1,10/03/2004,19.00.00,13.3,47.7,0.7255,2004-03-10 19:00:00,19,2004,3,10,2
2,10/03/2004,20.00.00,11.9,54.0,0.7502,2004-03-10 20:00:00,20,2004,3,10,2
3,10/03/2004,21.00.00,11.0,60.0,0.7867,2004-03-10 21:00:00,21,2004,3,10,2
4,10/03/2004,22.00.00,11.2,59.6,0.7888,2004-03-10 22:00:00,22,2004,3,10,2

In [18]:
data_air['hour_4cut'] = pd.cut(data_air['hour'], 4, labels=['night', 'morning', 'afternoon', 'evening'])

In [19]:
data_air.head()

,Date,Time,T,RH,AH,Date_Time,hour,year,month,day,weekday,hour_4cut
0,10/03/2004,18.00.00,13.6,48.9,0.7578,2004-03-10 18:00:00,18,2004,3,10,2,evening
1,10/03/2004,19.00.00,13.3,47.7,0.7255,2004-03-10 19:00:00,19,2004,3,10,2,evening
2,10/03/2004,20.00.00,11.9,54.0,0.7502,2004-03-10 20:00:00,20,2004,3,10,2,evening
3,10/03/2004,21.00.00,11.0,60.0,0.7867,2004-03-10 21:00:00,21,2004,3,10,2,evening
4,10/03/2004,22.00.00,11.2,59.6,0.7888,2004-03-10 22:00:00,22,2004,3,10,2,evening

In [20]:
air_byhour_4cut = data_air.groupby(['weekday', 'hour_4cut'])

In [239]:
air_byhour_4cut.agg(['mean', 'std'])[['T', 'RH', 'AH']].head(16)

                           T                    RH                    AH  \
                        mean        std       mean        std       mean
weekday hour_4cut
0       night       8.560417  37.149948  49.328274  45.671654  -4.969336
        morning    12.946726  29.775933  46.394940  36.515607  -2.594567
        afternoon  16.946847  35.359127  30.296997  39.462263  -3.883023
        evening    12.748182  34.546585  40.380606  40.823595  -3.890700
1       night      10.911818  29.606657  52.523030  37.238134  -2.642614
        morning    12.613636  30.162164  47.876970  37.370683  -2.648427
        afternoon  17.731515  35.769710  29.989394  39.643012  -3.898698
        evening     2.911212  57.512109  30.868485  66.769626 -13.555885
2       night      -1.210606  57.417294  39.555152  69.894083 -14.169472
        morning     3.680000  52.506222  39.236061  62.749085 -11.126616
        afternoon  11.072121  51.750210  25.091818  57.028147  -9.945538
        evening    11.073810  41.552852  39.775893  48.898722  -6.123480
3       night       7.573214  40.630535  49.642857  49.784139  -6.118334
        morning     5.315476  49.604721  40.133333  59.054008  -9.720195
        afternoon   9.389583  55.000756  23.332143  60.069519 -11.530443
        evening     6.620536  51.298823  35.233036  59.688949 -10.289001


                         std
weekday hour_4cut
0       night      34.211403
        morning    26.660788
        afternoon  30.818108
        evening    30.960601
1       night      26.900699
        morning    26.899831
        afternoon  30.959348
        evening    52.295689
2       night      53.285454
        morning    48.048387
        afternoon  45.720673
        evening    37.369320
3       night      37.370443
        morning    45.339768
        afternoon  48.736635
        evening    46.516060

In [233]:
air_bymonth = data_air.groupby(['month', 'weekday'])

In [237]:
air_bymonth.agg({'T' : 'max', 'RH' : 'max', 'AH' : 'max'}).head(14)

                  T    RH      AH
month weekday
1     0        14.4  80.4  1.0567
      1        13.8  83.0  1.0087
      2        15.8  83.8  0.9972
      3        16.5  82.1  0.9687
      4        13.5  83.8  0.8706
      5        15.8  86.6  0.9681
      6        16.9  78.2  0.9826
2     0        13.7  84.3  0.7425
      1        13.9  86.6  0.7165
      2        14.5  83.9  0.6875
      3        15.7  85.3  0.7519
      4        15.0  84.1  0.7530
      5        13.8  75.1  0.7506
      6        19.9  85.0  1.0859